TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
            nrf_aar->ADDRPTR = reinterpret_cast< std::uint32_t >( receive_buffer_.buffer ) + connect_addr_offset;
        }

        NRF_PPI->CHENCLR = ( 1 << compare0_rxen_ppi_channel );
        NRF_PPI->CHENSET =
              ( 1 << compare0_txen_ppi_channel )
            | ( 1 << compare1_disable_ppi_channel )
            | ( 1 << radio_end_capture2_ppi_channel );

        NRF_RADIO->INTENSET    = RADIO_INTENSET_DISABLED_Msk;

        const std::uint32_t read_timeout = ( send_size + 1 + 4 + 3 ) * 8 + adv_reponse_timeout_us;
        state_ = state::adv_transmitting;

        if ( when.zero() )
        {
            NRF_RADIO->TASKS_TXEN          = 1;
            nrf_timer->TASKS_CAPTURE[ 1 ]  = 1;
            nrf_timer->CC[ 1 ]            += read_timeout + us_radio_tx_startup_time;
        }
        else
        {
            nrf_timer->EVENTS_COMPARE[ 0 ] = 0;
            nrf_timer->CC[ 0 ]             = when.usec() - us_radio_tx_startup_time + anchor_offset_.usec();
            nrf_timer->CC[ 1 ]             = nrf_timer->CC[ 0 ] + us_radio_tx_startup_time + read_timeout;
            nrf_timer->CC[ 2 ]             = 0;

            // manually triggering event for timer beeing already behind target time
            nrf_timer->TASKS_CAPTURE[ 3 ]  = 1;

            // TODO: If timer wrapps, >= will fail!!!
            if ( nrf_timer->EVENTS_COMPARE[ 0 ] || nrf_timer->CC[ 3 ] >= nrf_timer->CC[ 0 ] )
            {
                nrf_timer->TASKS_CLEAR = 1;
                NRF_RADIO->TASKS_TXEN = 1;
            }
        }
    }

    bool scheduled_radio_base::is_valid_scan_request() const
    {
        static constexpr std::uint8_t scan_request_size     = 12;
        static constexpr std::uint8_t scan_request_pdu_type = 0x03;
        static constexpr std::uint8_t pdu_type_mask         = 0x0F;
        static constexpr int          pdu_header_size       = 2;
        static constexpr int          addr_size             = 6;
        static constexpr std::uint8_t tx_add_mask           = 0x40;
        static constexpr std::uint8_t rx_add_mask           = 0x80;

        if ( identity_resolving_enabled )
        {
            while ( !nrf_aar->EVENTS_END )
                ;

            if ( nrf_aar->EVENTS_NOTRESOLVED )
                return false;
        }

        if ( receive_buffer_.buffer[ 1 ] != scan_request_size )
            return false;

        if ( ( receive_buffer_.buffer[ 0 ] & pdu_type_mask ) != scan_request_pdu_type )
            return false;

        const int pdu_gap = pdu_gap_required_by_encryption();

        if ( !std::equal( &receive_buffer_.buffer[ pdu_header_size + addr_size + pdu_gap ], &receive_buffer_.buffer[ pdu_header_size + 2 * addr_size + pdu_gap ],
            &response_data_.buffer[ pdu_header_size + pdu_gap ] ) )
            return false;

        // in the scan request, the randomness is stored in RxAdd, in the scan response, it's stored in
        // TxAdd.
        const bool scanner_addres_is_random = response_data_.buffer[ 0 ] & tx_add_mask;
        if ( !static_cast< bool >( receive_buffer_.buffer[ 0 ] & rx_add_mask ) == scanner_addres_is_random )
            return false;

        const link_layer::device_address scanner( &receive_buffer_.buffer[ pdu_header_size + pdu_gap ], scanner_addres_is_random );

        return callbacks_.is_scan_request_in_filter_callback( scanner );
    }

    void scheduled_radio_base::stop_radio()
    {
        NRF_RADIO->SHORTS        = 0;
        NRF_RADIO->TASKS_DISABLE = 1;

        state_      = state::idle;
    }

    void scheduled_radio_base::adv_radio_interrupt()
    {
        if ( NRF_RADIO->EVENTS_DISABLED )
        {
            NRF_RADIO->EVENTS_DISABLED = 0;

            if ( state_ == state::adv_transmitting )
            {
                NRF_RADIO->SHORTS      = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk | RADIO_SHORTS_DISABLED_TXEN_Msk;

                NRF_RADIO->PACKETPTR   = reinterpret_cast< std::uint32_t >( receive_buffer_.buffer );
                NRF_RADIO->PCNF1       = ( NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk ) | ( receive_buffer_.size << RADIO_PCNF1_MAXLEN_Pos );

                state_ = state::adv_receiving;
            }
            else if ( state_ == state::adv_receiving )
            {
                // the anchor is the end of the connect request. The timer was captured with the radio end event
                anchor_offset_ = link_layer::delta_time( nrf_timer->CC[ 2 ] );

                // either we realy received something, or the timer disabled the radio.
                if ( ( NRF_RADIO->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk ) == RADIO_CRCSTATUS_CRCSTATUS_CRCOk && NRF_RADIO->EVENTS_PAYLOAD )
                {
                    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk;

                    // stop the timer from canceling the read!
                    NRF_PPI->CHENCLR  = ( 1 << compare0_txen_ppi_channel )
                                      | ( 1 << compare1_disable_ppi_channel )
                                      | ( 1 << radio_end_capture2_ppi_channel );

                    if ( is_valid_scan_request() )
                    {
                        state_ = state::adv_transmitting_response;

                        NRF_RADIO->PACKETPTR   = reinterpret_cast< std::uint32_t >( response_data_.buffer );
                        NRF_RADIO->PCNF1       = ( NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk ) | ( response_data_.size << RADIO_PCNF1_MAXLEN_Pos );
                    }
                    else
                    {
                        stop_radio();
                        received_   = true;
                    }
                }
                else
                {
                    stop_radio();
                    timeout_    = true;
                }
            }
            else if ( state_ == state::adv_transmitting_response )
            {
                stop_radio();
                timeout_    = true;
            }

            NRF_RADIO->EVENTS_PAYLOAD = 0;
        }
    }

    void scheduled_radio_base::adv_timer_interrupt()
    {
    }

    void scheduled_radio_base::configure_encryption( bool receive, bool transmit )
    {
        receive_encrypted_ = receive;
        transmit_encrypted_ = transmit;
    }

