TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
    static struct alignas( 4 ) ccm_data_struct_t {
        std::uint8_t data[ 33 ];
    } ccm_data_struct;

    // hack to be able to reset the CCM with every connection event
    static std::uint32_t scratch_area_save;

    link_layer::delta_time scheduled_radio_base::start_connection_event_impl(
        unsigned                        channel,
        bluetoe::link_layer::delta_time start_receive,
        bluetoe::link_layer::delta_time end_receive,
        const link_layer::read_buffer&  receive_buffer )
    {
        while ((NRF_RADIO->STATE & RADIO_STATE_STATE_Msk) != RADIO_STATE_STATE_Disabled)
            ;

        // Stop all interrupts so that the calculation, that enough CPU time is available to setup everything, will not
        // be disturbed by any interrupt.
        lock_guard lock;

        assert( ( NRF_RADIO->STATE & RADIO_STATE_STATE_Msk ) == RADIO_STATE_STATE_Disabled );
        assert( state_ == state::idle );
        assert( receive_buffer.buffer && receive_buffer.size >= 2u || receive_buffer.empty() );
        assert( start_receive < end_receive );

        nrf_timer->TASKS_CAPTURE[ 3 ] = 1;
        const std::uint32_t now   = nrf_timer->CC[ 3 ];
        const std::uint32_t start_event = start_receive.usec() + anchor_offset_.usec() - us_radio_rx_startup_time;
        const std::uint32_t end_event   = end_receive.usec() + anchor_offset_.usec() + 500; // TODO: 500: must depend on receive size.

        if ( now + setup_connection_event_limit_us > start_event )
        {
            evt_timeout_ = true;
            return link_layer::delta_time();
        }

        state_                  = state::evt_wait_connect;
        receive_buffer_         = receive_buffer.empty()
            ? link_layer::read_buffer{ &empty_receive_[ 0 ], sizeof( empty_receive_ ) }
            : receive_buffer;

        NRF_RADIO->FREQUENCY   = frequency_from_channel( channel );
        NRF_RADIO->DATAWHITEIV = channel & 0x3F;

        NRF_RADIO->INTENCLR    = 0xffffffff;
        nrf_timer->INTENCLR    = 0xffffffff;

        NRF_RADIO->EVENTS_END       = 0;
        NRF_RADIO->EVENTS_DISABLED  = 0;
        NRF_RADIO->EVENTS_READY     = 0;
        NRF_RADIO->EVENTS_ADDRESS   = 0;
        NRF_RADIO->EVENTS_CRCERROR  = 0;

        nrf_timer->EVENTS_COMPARE[ 0 ] = 0;
        nrf_timer->EVENTS_COMPARE[ 1 ] = 0;
        nrf_timer->EVENTS_COMPARE[ 2 ] = 0;

        if ( receive_encrypted_ )
        {
            nrf_radio->PCNF1  = ( NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk )
                | ( ( receive_buffer_.size + encryption_mic_size ) << RADIO_PCNF1_MAXLEN_Pos );

            // Reseting the CCM before every connection event seems to workaround a bug that
            // Causes the CCM to start decrypting an incomming PDU, before it was actually received
            // which causes overwriting the receive buffer, if the length field in the encrypted_area_
            // was long enough.
            // (https://devzone.nordicsemi.com/f/nordic-q-a/43656/what-causes-decryption-before-receiving)
            nrf_ccm->ENABLE = CCM_ENABLE_ENABLE_Disabled;
            nrf_ccm->ENABLE = CCM_ENABLE_ENABLE_Enabled;
            nrf_ccm->MODE   =
                  ( CCM_MODE_MODE_Decryption << CCM_MODE_MODE_Pos )
                | ( CCM_MODE_LENGTH_Extended << CCM_MODE_LENGTH_Pos );
            nrf_ccm->CNFPTR = reinterpret_cast< std::uintptr_t >( &ccm_data_struct );
            nrf_ccm->INPTR = encrypted_area_;
            nrf_ccm->OUTPTR = reinterpret_cast< std::uint32_t >( receive_buffer_.buffer );
            nrf_ccm->SCRATCHPTR = scratch_area_save;
            nrf_ccm->SHORTS = 0;
            nrf_ccm->EVENTS_ENDKSGEN = 0;
            nrf_ccm->EVENTS_ENDCRYPT = 0;
            nrf_ccm->EVENTS_ERROR = 0;
            nrf_radio->PACKETPTR = encrypted_area_;
        }
        else
        {
            nrf_radio->PCNF1       = ( NRF_RADIO->PCNF1 & ~RADIO_PCNF1_MAXLEN_Msk ) | ( receive_buffer_.size << RADIO_PCNF1_MAXLEN_Pos );

            nrf_radio->PACKETPTR   = reinterpret_cast< std::uint32_t >( receive_buffer_.buffer );
        }

        // the hardware is wired to:
        // - start the receiving part of the radio, when the timer is equal to CC[ 0 ] (compare0_rxen_ppi_channel)
        // - when the radio ramped up for receiving, the receiving starts              (RADIO_SHORTS_READY_START_Msk)
        // - when the PDU was receieved, the timer value is captured in CC[ 2 ]        (radio_end_capture2_ppi_channel)
        // - when a PDU is received, the radio is stopped                              (RADIO_SHORTS_END_DISABLE_Msk)
        // - if no PDU is received, and the timer reaches CC[ 1 ], the radio is stopped(compare1_disable_ppi_channel)
        nrf_radio->SHORTS      = RADIO_SHORTS_READY_START_Msk | RADIO_SHORTS_END_DISABLE_Msk | RADIO_SHORTS_DISABLED_TXEN_Msk;
        nrf_ccm->SHORTS        = 0;

        if ( receive_encrypted_ )
        {
            NRF_PPI->CHENCLR =
                  ( 1 << compare0_txen_ppi_channel )
                | ( 1 << radio_bcmatch_aar_start_channel );

            NRF_PPI->CHENSET =
                ( 1 << radio_address_ccm_crypt )
              | ( 1 << compare0_rxen_ppi_channel )
              | ( 1 << compare1_disable_ppi_channel )
              | ( 1 << radio_end_capture2_ppi_channel );

            nrf_ccm->TASKS_KSGEN = 1;
            NRF_GPIOTE->TASKS_SET[ 1 ] = 1;
        }
        else
        {
            NRF_PPI->CHENCLR =
                  ( 1 << compare0_txen_ppi_channel )
                | ( 1 << compare0_rxen_ppi_channel )
                | ( 1 << compare1_disable_ppi_channel )
                | ( 1 << radio_end_capture2_ppi_channel )
                | ( 1 << radio_address_ccm_crypt )
                | ( 1 << radio_bcmatch_aar_start_channel );

            NRF_PPI->CHENSET       =
                  ( 1 << compare0_rxen_ppi_channel )
                | ( 1 << compare1_disable_ppi_channel )
                | ( 1 << radio_end_capture2_ppi_channel );
        }


        nrf_radio->INTENSET    = RADIO_INTENSET_DISABLED_Msk;

        nrf_timer->CC[ 0 ] = start_event;
        nrf_timer->CC[ 1 ] = end_event;

