TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
    }

    void scheduled_radio_base::timer_interrupt()
    {
        if ( static_cast< unsigned >( state_ ) >= connection_event_type_base )
        {
            evt_timer_interrupt();
        }
        else
        {
            adv_timer_interrupt();
        }
    }

    void scheduled_radio_base::set_access_address_and_crc_init( std::uint32_t access_address, std::uint32_t crc_init )
    {
        NRF_RADIO->BASE0     = ( access_address << 8 ) & 0xFFFFFF00;
        NRF_RADIO->PREFIX0   = ( access_address >> 24 ) & RADIO_PREFIX0_AP0_Msk;
        NRF_RADIO->CRCINIT   = crc_init;
    }

    void scheduled_radio_base::run()
    {
        while ( !received_ && !timeout_ && !evt_timeout_ && !end_evt_ && wake_up_ == 0 )
            __WFI();

        if ( received_ )
        {
            assert( reinterpret_cast< std::uint8_t* >( NRF_RADIO->PACKETPTR ) == receive_buffer_.buffer );

            receive_buffer_.size = std::min< std::size_t >(
                receive_buffer_.size,
                ( receive_buffer_.buffer[ 1 ] & 0x3f ) + 2 + pdu_gap_required_by_encryption()
            );
            received_ = false;

            callbacks_.adv_received( receive_buffer_ );
        }

        if ( timeout_ )
        {
            timeout_ = false;
            callbacks_.adv_timeout();
        }

        if ( evt_timeout_ )
        {
            evt_timeout_ = false;
            callbacks_.timeout();
        }

        if ( end_evt_ )
        {
            end_evt_ = false;
            callbacks_.end_event();
        }

        if ( wake_up_ )
        {
            --wake_up_;
        }
    }

    void scheduled_radio_base::wake_up()
    {
        ++wake_up_;
    }

    std::uint32_t scheduled_radio_base::static_random_address_seed() const
    {
        return NRF_FICR->DEVICEID[ 0 ];
    }

    void scheduled_radio_base::nrf_flash_memory_access_begin()
    {
        lock_guard lock;

        nrf_ccm->OUTPTR  = 0;
        nrf_ccm->INPTR   = 0;
        nrf_radio->PACKETPTR = 0;

        nrf_ccm->EVENTS_ERROR    = 0;
        nrf_ccm->SHORTS          = 0;

        NRF_PPI->CHENCLR =
              ( 1 << compare0_txen_ppi_channel )
            | ( 1 << compare0_rxen_ppi_channel )
            | ( 1 << compare1_disable_ppi_channel )
            | ( 1 << radio_end_capture2_ppi_channel )
            | ( 1 << radio_address_ccm_crypt );

        NRF_RADIO->SHORTS        = 0;
        NRF_RADIO->TASKS_STOP    = 1;
        NRF_RADIO->TASKS_DISABLE = 1;
        nrf_ccm->TASKS_STOP      = 1;

        state_       = state::idle;
    }

    void scheduled_radio_base::nrf_flash_memory_access_end()
    {
        // this kicks the CPU out of the loop in run() and requests the link layer to setup the next connection event
        evt_timeout_ = true;
    }

    /*
     * With encryption
     */

    // simply for easier debugging
    static NRF_RNG_Type* const          nrf_random  = NRF_RNG;
    static NRF_ECB_Type* const          nrf_aes     = NRF_ECB;

    static std::uint8_t random_number8()
    {
        nrf_random->TASKS_START = 1;

        while ( !nrf_random->EVENTS_VALRDY )
            ;

        nrf_random->EVENTS_VALRDY = 0;

        return nrf_random->VALUE;
    }

    static std::uint16_t random_number16()
    {
        return static_cast< std::uint16_t >( random_number8() )
            | ( static_cast< std::uint16_t >( random_number8() ) << 8 );
    }

    static std::uint32_t random_number32()
    {
        return static_cast< std::uint32_t >( random_number16() )
            | ( static_cast< std::uint32_t >( random_number16() ) << 16 );
    }

    static std::uint64_t random_number64()
    {
        return static_cast< std::uint64_t >( random_number32() )
            | ( static_cast< std::uint64_t >( random_number32() ) << 32 );
    }

    static constexpr std::size_t ccm_key_offset = 0;
    static constexpr std::size_t ccm_packet_counter_offset = 16;
    static constexpr std::size_t ccm_packet_counter_size   = 5;
    static constexpr std::size_t ccm_direction_offset = 24;
    static constexpr std::size_t ccm_iv_offset = 25;

    static constexpr std::uint8_t central_to_peripheral_ccm_direction = 0x01;
    static constexpr std::uint8_t peripheral_to_central_ccm_direction = 0x00;

    static void init_ccm_data_structure( std::uint32_t scratch_area )
    {
        scratch_area_save   = scratch_area;
        nrf_ccm->SCRATCHPTR = scratch_area;
        nrf_ccm->CNFPTR     = reinterpret_cast< std::uintptr_t >( &ccm_data_struct );
    }

    // Note: While every function above the link layer uses low to high byte order inputs to the
    // EAS function, the CCM, that encrypts the link layer trafic, uses high to low byte order.
    // That's why the intput and output in aes_le() changeing the byte order. The result of the
    // key deversification is the key for the CCM algorithm and thus have to be stored in high to
    // low byte order.

    static void setup_ccm_data_structure( const bluetoe::details::uint128_t& key, std::uint64_t IV )
    {
        std::copy( key.rbegin(), key.rend(), &ccm_data_struct.data[ ccm_key_offset ] );
        std::fill( &ccm_data_struct.data[ ccm_packet_counter_offset ],
            &ccm_data_struct.data[ ccm_packet_counter_offset + ccm_packet_counter_size ], 0 );

        details::write_64bit( &ccm_data_struct.data[ ccm_iv_offset ], IV );
    }

    static bluetoe::details::uint128_t aes_le( const bluetoe::details::uint128_t& key, const std::uint8_t* data )
    {
        static struct alignas( 4 ) ecb_data_t {
            std::uint8_t data[ 3 * 16 ];
        } ecb_scratch_data;

        nrf_aes->ECBDATAPTR = reinterpret_cast< std::uint32_t >( &ecb_scratch_data.data[ 0 ] );

        std::copy( key.rbegin(), key.rend(), &ecb_scratch_data.data[ 0 ] );
        std::reverse_copy( data, data + 16, &ecb_scratch_data.data[ 16 ] );

        nrf_aes->TASKS_STARTECB = 1;

        while ( !nrf_aes->EVENTS_ENDECB && !nrf_aes->EVENTS_ERRORECB )
            ;

        assert( !nrf_aes->EVENTS_ERRORECB );
        nrf_aes->EVENTS_ENDECB = 0;

        bluetoe::details::uint128_t result;
        std::copy( &ecb_scratch_data.data[ 32 ], &ecb_scratch_data.data[ 48 ], result.rbegin() );

        // erase key out of memory
        std::fill( &ecb_scratch_data.data[ 0 ], &ecb_scratch_data.data[ 16 ], 0 );

        return result;
    }

    static bluetoe::details::uint128_t aes_le( const bluetoe::details::uint128_t& key, const bluetoe::details::uint128_t& data )
    {
        return aes_le( key, data.data() );
    }

    static bluetoe::details::uint128_t xor_( bluetoe::details::uint128_t a, const std::uint8_t* b )
    {
        std::transform(
            a.begin(), a.end(),
            b,
            a.begin(),
            []( std::uint8_t a, std::uint8_t b ) -> std::uint8_t
            {
                return a xor b;
            }
        );

        return a;
    }

