TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
    static bluetoe::details::uint128_t xor_( bluetoe::details::uint128_t a, const bluetoe::details::uint128_t& b )
    {
        return xor_( a, b.data() );
    }

    scheduled_radio_base_with_encryption_base::scheduled_radio_base_with_encryption_base(
        adv_callbacks& cbs, std::uint32_t scratch_area, std::uint32_t encrypted_area )
        : scheduled_radio_base( cbs, encrypted_area )
    {
        nrf_random->CONFIG = RNG_CONFIG_DERCEN_Msk;
        nrf_random->SHORTS = RNG_SHORTS_VALRDY_STOP_Msk;

        init_ccm_data_structure( scratch_area );
    }

    details::uint128_t scheduled_radio_base_with_encryption_base::create_srand()
    {
        details::uint128_t result;
        std::generate( result.begin(), result.end(), random_number8 );

        return result;
    }

    details::longterm_key_t scheduled_radio_base_with_encryption_base::create_long_term_key()
    {
        const details::longterm_key_t result = {
            create_srand(),
            random_number64(),
            random_number16()
        };

        return result;
    }

    details::uint128_t scheduled_radio_base_with_encryption_base::c1(
        const bluetoe::details::uint128_t& temp_key,
        const bluetoe::details::uint128_t& rand,
        const bluetoe::details::uint128_t& p1,
        const bluetoe::details::uint128_t& p2 ) const
    {
        // c1 (k, r, preq, pres, iat, rat, ia, ra) = e(k, e(k, r XOR p1) XOR p2)
        const auto p1_ = aes_le( temp_key, xor_( rand, p1 ) );

        return aes_le( temp_key, xor_( p1_, p2 ) );
    }

    bluetoe::details::uint128_t scheduled_radio_base_with_encryption_base::s1(
        const bluetoe::details::uint128_t& temp_key,
        const bluetoe::details::uint128_t& srand,
        const bluetoe::details::uint128_t& mrand )
    {
        bluetoe::details::uint128_t r;
        std::copy( &srand[ 0 ], &srand[ 8 ], &r[ 8 ] );
        std::copy( &mrand[ 0 ], &mrand[ 8 ], &r[ 0 ] );

        return aes_le( temp_key, r );
    }

    bool scheduled_radio_base_with_encryption_base::is_valid_public_key( const std::uint8_t* public_key ) const
    {
        bluetoe::details::ecdh_public_key_t key;
        std::reverse_copy(public_key, public_key + 32, key.begin());
        std::reverse_copy(public_key + 32, public_key + 64, key.begin() + 32);

        return uECC_valid_public_key( key.data() );
    }

    std::pair< bluetoe::details::ecdh_public_key_t, bluetoe::details::ecdh_private_key_t > scheduled_radio_base_with_encryption_base::generate_keys()
    {
        uECC_set_rng( []( uint8_t *dest, unsigned size )->int {
            std::generate( dest, dest + size, random_number8 );

            return 1;
        } );

        bluetoe::details::ecdh_public_key_t  public_key;
        bluetoe::details::ecdh_private_key_t private_key;

        const auto rc = uECC_make_key( public_key.data(), private_key.data() );
        static_cast< void >( rc );
        assert( rc == 1 );

        std::reverse( public_key.begin(), public_key.begin() + 32 );
        std::reverse( public_key.begin() + 32, public_key.end() );
        std::reverse( private_key.begin(), private_key.end() );

        return { public_key, private_key };
    }

    bluetoe::details::uint128_t scheduled_radio_base_with_encryption_base::select_random_nonce()
    {
        bluetoe::details::uint128_t result;
        std::generate( result.begin(), result.end(), random_number8 );

        return result;
    }

    bluetoe::details::ecdh_shared_secret_t scheduled_radio_base_with_encryption_base::p256( const std::uint8_t* private_key, const std::uint8_t* public_key )
    {
        bluetoe::details::ecdh_private_key_t shared_secret;
        bluetoe::details::ecdh_private_key_t priv_key;
        bluetoe::details::ecdh_public_key_t  pub_key;
        std::reverse_copy( public_key, public_key + 32, pub_key.begin() );
        std::reverse_copy( public_key + 32, public_key + 64, pub_key.begin() + 32 );
        std::reverse_copy( private_key, private_key + 32, priv_key.begin() );

        const int rc = uECC_shared_secret( pub_key.data(), priv_key.data(), shared_secret.data() );
        static_cast< void >( rc );
        assert( rc == 1 );

        bluetoe::details::ecdh_shared_secret_t result;
        std::reverse_copy( shared_secret.begin(), shared_secret.end(), result.begin() );

        return result;
    }

    static bluetoe::details::uint128_t left_shift(const bluetoe::details::uint128_t& input)
    {
        bluetoe::details::uint128_t output;

        std::uint8_t overflow = 0;
        for ( std::size_t i = 0; i != input.size(); ++i )
        {
            output[ i ] = ( input[i] << 1 ) | overflow;
            overflow = ( input[ i ] & 0x80 ) ? 1 : 0;
        }

        return output;
    }

    static bluetoe::details::uint128_t aes_cmac_k1_subkey_generation( const bluetoe::details::uint128_t& key )
    {
        const bluetoe::details::uint128_t zero = {{ 0x00 }};
        const bluetoe::details::uint128_t C    = {{ 0x87 }};

        const bluetoe::details::uint128_t k0 = aes_le( key, zero );

        const bluetoe::details::uint128_t k1 = ( k0.back() & 0x80 ) == 0
            ? left_shift(k0)
            : xor_( left_shift(k0), C );

        return k1;
    }

    static bluetoe::details::uint128_t aes_cmac_k2_subkey_generation( const bluetoe::details::uint128_t& key )
    {
        const bluetoe::details::uint128_t C    = {{ 0x87 }};

        const bluetoe::details::uint128_t k1 = aes_cmac_k1_subkey_generation( key );
        const bluetoe::details::uint128_t k2 = ( k1.back() & 0x80 ) == 0
            ? left_shift(k1)
            : xor_( left_shift(k1), C );

        return k2;
    }

    bluetoe::details::uint128_t scheduled_radio_base_with_encryption_base::f4( const std::uint8_t* u, const std::uint8_t* v, const std::array< std::uint8_t, 16 >& k, std::uint8_t z )
    {
        const bluetoe::details::uint128_t m4 = {{
            0x00, 0x00, 0x00, 0x00,
            0x00, 0x00, 0x00, 0x00,
            0x00, 0x00, 0x00, 0x00,
            0x00, 0x00, 0x80, z
        }};

