TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
        auto t0 = aes_le( k, &u[16] );
        auto t1 = aes_le( k, xor_( t0, &u[0] ) );
        auto t2 = aes_le( k, xor_( t1, &v[16] ) );
        auto t3 = aes_le( k, xor_( t2, &v[0] ) );

        return aes_le( k, xor_( t3, xor_( aes_cmac_k2_subkey_generation( k ), m4 ) ) );
    }

    static bluetoe::details::uint128_t f5_cmac(
        const bluetoe::details::uint128_t& key,
        const std::uint8_t* buffer )
    {
        const std::uint8_t* m0 = &buffer[ 48 ];
        const std::uint8_t* m1 = &buffer[ 32 ];
        const std::uint8_t* m2 = &buffer[ 16 ];
        const std::uint8_t* m3 = &buffer[ 0 ];

        auto t0 = aes_le( key, m0 );
        auto t1 = aes_le( key, xor_( t0, m1 ) );
        auto t2 = aes_le( key, xor_( t1, m2 ) );

        return aes_le( key, xor_( t2, xor_( aes_cmac_k2_subkey_generation( key ), m3 ) ) );
    }

    static bluetoe::details::uint128_t f5_key( const bluetoe::details::ecdh_shared_secret_t dh_key )
    {
        static const bluetoe::details::uint128_t salt = {{
            0xBE, 0x83, 0x60, 0x5A, 0xDB, 0x0B, 0x37, 0x60,
            0x38, 0xA5, 0xF5, 0xAA, 0x91, 0x83, 0x88, 0x6C
        }};

        auto t0 = aes_le( salt, &dh_key[ 16 ] );

        return aes_le( salt, xor_( t0, xor_( aes_cmac_k1_subkey_generation( salt ), &dh_key[ 0 ] ) ) );
    }

    std::pair< bluetoe::details::uint128_t, bluetoe::details::uint128_t > scheduled_radio_base_with_encryption_base::f5(
        const bluetoe::details::ecdh_shared_secret_t dh_key,
        const bluetoe::details::uint128_t& nonce_central,
        const bluetoe::details::uint128_t& nonce_periperal,
        const bluetoe::link_layer::device_address& addr_controller,
        const bluetoe::link_layer::device_address& addr_peripheral )
    {
        // all 4 blocks are allocated in revers order to make it easier to copy data that overlaps
        // two blocks
        std::uint8_t buffer[ 64 ] = { 0 };

        static const std::uint8_t m0_fill[] = {
            0x65, 0x6c, 0x74, 0x62
        };

        static const std::uint8_t m3_fill[] = {
            0x80, 0x00, 0x01
        };

        std::copy( std::begin( m0_fill ), std::end( m0_fill ), &buffer[ 11 + 48 ] );
        std::copy( std::begin( m3_fill ), std::end( m3_fill ), &buffer[ 10 ] );

        std::copy( nonce_central.begin(), nonce_central.end(), &buffer[ 32 + 11 ] );
        std::copy( nonce_periperal.begin(), nonce_periperal.end(), &buffer[ 16 + 11 ] );

        buffer[ 16 + 10 ] = addr_controller.is_random() ? 1 : 0;
        std::copy( addr_controller.begin(), addr_controller.end(), &buffer[ 16 + 4 ] );
        buffer[ 16 + 3 ] = addr_peripheral.is_random() ? 1 : 0;
        std::copy( addr_peripheral.begin(), addr_peripheral.end(), &buffer[ 13 ] );

        const bluetoe::details::uint128_t key     = f5_key( dh_key );
        const bluetoe::details::uint128_t mac_key = f5_cmac( key, buffer );
        // increment counter
        buffer[ 15 + 48 ] = 1;
        const bluetoe::details::uint128_t ltk     = f5_cmac( key, buffer );

        return { mac_key, ltk };
    }

    bluetoe::details::uint128_t scheduled_radio_base_with_encryption_base::f6(
        const bluetoe::details::uint128_t& key,
        const bluetoe::details::uint128_t& n1,
        const bluetoe::details::uint128_t& n2,
        const bluetoe::details::uint128_t& r,
        const bluetoe::details::io_capabilities_t& io_caps,
        const bluetoe::link_layer::device_address& addr_controller,
        const bluetoe::link_layer::device_address& addr_peripheral )
    {
        std::uint8_t m4_m3[ 32 ] = { 0 };

        std::copy( io_caps.begin(), io_caps.end(), &m4_m3[ 16 + 13 ] );
        m4_m3[ 16 + 12 ] = addr_controller.is_random() ? 1 : 0;
        std::copy( addr_controller.begin(), addr_controller.end(), &m4_m3[ 22 ] );
        m4_m3[ 16 + 5 ] = addr_peripheral.is_random() ? 1 : 0;
        std::copy( addr_peripheral.begin(), addr_peripheral.end(), &m4_m3[ 15 ] );
        m4_m3[ 14 ] = 0x80;

        const std::uint8_t* m3 = &m4_m3[ 16 ];
        const std::uint8_t* m4 = &m4_m3[ 0 ];

        auto t0 = aes_le( key, n1 );
        auto t1 = aes_le( key, xor_( t0, n2 ) );
        auto t2 = aes_le( key, xor_( t1, r ) );
        auto t3 = aes_le( key, xor_( t2, m3 ) );

        return aes_le( key, xor_( t3, xor_( aes_cmac_k2_subkey_generation( key ), m4 ) ) );
    }

    std::uint32_t scheduled_radio_base_with_encryption_base::g2(
        const std::uint8_t*                 u,
        const std::uint8_t*                 v,
        const bluetoe::details::uint128_t&  x,
        const bluetoe::details::uint128_t&  y )
    {
        auto t0 = aes_le( x, u + 16 );
        auto t1 = aes_le( x, xor_( t0, u ) );
        auto t2 = aes_le( x, xor_( t1, v + 16 ) );
        auto t3 = aes_le( x, xor_( t2, v ) );
        auto t4 = aes_le( x, xor_( t3, xor_( aes_cmac_k1_subkey_generation( x ), y ) ) );

        return bluetoe::details::read_32bit( t4.begin() );
    }

    bluetoe::details::uint128_t scheduled_radio_base_with_encryption_base::create_passkey()
    {
        const bluetoe::details::uint128_t result{{
            random_number8(), random_number8(), random_number8()
        }};

        return result;
    }

    std::pair< std::uint64_t, std::uint32_t > scheduled_radio_base_with_encryption_base::setup_encryption(
        bluetoe::details::uint128_t key, std::uint64_t skdm, std::uint32_t ivm )
    {
        const std::uint64_t skds = random_number64();
        const std::uint32_t ivs  = random_number32();

        bluetoe::details::uint128_t session_descriminator;
        details::write_64bit( &session_descriminator[ 0 ], skdm );
        details::write_64bit( &session_descriminator[ 8 ], skds );

        setup_ccm_data_structure(
            aes_le( key, session_descriminator),
            static_cast< std::uint64_t >( ivm ) | ( static_cast< std::uint64_t >( ivs ) << 32 ) );

        return { skds, ivs };
    }

    void scheduled_radio_base_with_encryption_base::start_receive_encrypted()
    {
        rx_counter_ = counter();
        nrf_ccm->ENABLE = CCM_ENABLE_ENABLE_Enabled << CCM_ENABLE_ENABLE_Pos;
        configure_encryption( true, false );
    }

    void scheduled_radio_base_with_encryption_base::start_transmit_encrypted()
    {
        tx_counter_ = counter();
        configure_encryption( true, true );
    }

    void scheduled_radio_base_with_encryption_base::stop_receive_encrypted()
    {
        configure_encryption( false, true );
    }

    void scheduled_radio_base_with_encryption_base::stop_transmit_encrypted()
    {
        configure_encryption( false, false );

