TorstenRobitzki/bluetoe/bluetoe/bindings/nordic/nrf51/nrf51.cpp
        // remove key from memory
        std::memset( &ccm_data_struct, 0, sizeof( ccm_data_struct ) );
        nrf_ccm->ENABLE = nrf_ccm->ENABLE & ~CCM_ENABLE_ENABLE_Msk;
    }

    void scheduled_radio_base_with_encryption_base::load_receive_packet_counter()
    {
        rx_counter_.copy_to( &ccm_data_struct.data[ ccm_packet_counter_offset ] );
        ccm_data_struct.data[ ccm_direction_offset ] = central_to_peripheral_ccm_direction;
    }

    void scheduled_radio_base_with_encryption_base::load_transmit_packet_counter()
    {
        tx_counter_.copy_to( &ccm_data_struct.data[ ccm_packet_counter_offset ] );
        ccm_data_struct.data[ ccm_direction_offset ] = peripheral_to_central_ccm_direction;
    }

    void scheduled_radio_base_with_encryption_base::set_identity_resolving_key( const details::identity_resolving_key_t& irk )
    {
        static details::identity_resolving_key_t irk_storage;
        irk_storage = irk;

        identity_resolving_enabled = true;

        // disable CCM
        nrf_ccm->ENABLE   = CCM_ENABLE_ENABLE_Disabled;
        nrf_ccm->INTENCLR = 0xFFFFFFFF;
        nrf_ppi->CHENCLR  = ( 1 << radio_address_ccm_crypt );

        // setup AAR
        nrf_ppi->CHENSET    = ( 1 << radio_bcmatch_aar_start_channel );
        nrf_radio->BCC      = 16 + 2 * ( 6 * 8 );
        nrf_aar->SCRATCHPTR = scratch_area_save;
        nrf_aar->IRKPTR     = reinterpret_cast< std::uint32_t >( &irk_storage );
        nrf_aar->NIRK       = 1;

        nrf_aar->ENABLE     = AAR_ENABLE_ENABLE_Msk;
    }

} // namespace nrf51_details
}

extern "C" void RADIO_IRQHandler(void)
{
    bluetoe::nrf51_details::instance->radio_interrupt();
}

extern "C" void TIMER0_IRQHandler(void)
{
    bluetoe::nrf51_details::instance->timer_interrupt();
}
